
# 1 Арифметичні операції:
# Написати програму, яка зчитує два числа та виводить їхню суму, різницю, добуток та частку.


# print("\nЗадача 1\n")
# var_1 = int(input("Введіть перше число: "))
# var_2 = int(input("Введіть друге число: "))
# result = var_1 + var_2
# print(f"{var_1} + {var_2}  = {result}")
# result = var_1 - var_2
# print(f"{var_1} - {var_2}  = {result}")
# result = var_1 * var_2
# print(f"{var_1} * {var_2}  = {result}")
# result = var_1 / var_2
# print(f"{var_1} / {var_2}  = {result}")
#=======================================================================================================================


# 2 Залишок від ділення:
# Користувач вводить два числа. Вивести залишок від ділення першого числа на друге.


# print("\nЗадача 2\n")
# var_1 = int(input("Введіть перше число: "))
# var_2 = int(input("Введіть друге число: "))
# result = var_1 % var_2
# print(result)
#=======================================================================================================================


# 3 Цілочисельне ділення:
# Користувач вводить два числа. Вивести, скільки разів перше число ділиться на друге без залишку.


# print("\nЗадача 3\n")
# var_1 = int(input("Введіть перше число: "))
# var_2 = int(input("Введіть друге число: "))
# result = var_1 // var_2
# print(result)
#=======================================================================================================================


# 4 Перетворення стрічки у число:
# Користувач вводить рядок, який складається з цифр. Програма повинна перетворити його на число та вивести.


# print("\nЗадача 4\n")
# var_1 = int(input("Введіть  число: "))
# print(var_1)
#=======================================================================================================================


# 5 Стрічкова конкатенація + математика:
# Користувач вводить два числа. Програма повинна вивести два прінти: перший — їхню суму,
# другий об'єднати їх. Якщо в нас числа 5 та 4, то результат повинен бути 9 та 54.


# print("\nЗадача 5\n")
# var_1 = int(input("Введіть перше число: "))
# var_2 = int(input("Введіть друге число: "))
# result = var_1 + var_2
# print(result)
# print(f"{var_1}"+f"{var_2}")
#=======================================================================================================================


# 6 Вік користувача:
# Запитати у користувача його рік народження, ім'я та який зараз рік (три змінні)
# та вивести на екран два прінти: ім'я та скільки років користувачу.


# print("\nЗадача 6\n")
# var_1 = input("Введіть ваше ім'я: ")
# var_2 = int(input("Введіть рік вашого народження: "))
# var_3 = int(input("Введіть який зараз рік: "))
# result = var_3 - var_2
# print(f"{var_1} вам {result} років.")
#=======================================================================================================================


# 7 Перевод з цельсія в фаренгейт:
# Напишіть програму, яка запитує в користувача кількість градусів в цельсіях і повертає в фаренгейтах.


# print("\nЗадача 7\n")
# var_1 = int(input("Введіть температуру по сельсію: "))
# result = float(var_1 * 1.8 + 32)
# print(result , "градусів по Фарингейту")
#=======================================================================================================================


# 8 Перевод з фаренгейта в цельсій:
# Напишіть програму, яка запитує в користувача кількість градусів в фаренгейтах і повертає в цельсіях.
# Вам може здатися, що ця задача така ж, як попередня, але будьте уважні і перевірте результат вручну.


# print("\nЗадача 8\n")
# var_1 = int(input("Введіть температуру по фарингейту: "))
# result = (var_1 - 32)/1.8
# print(result, "градусів по Фарингейту")
#=======================================================================================================================


# 9 Теорема Піфагора:
# Запитайте у користувача довжини катетів та виведіть на екран довжину гіпотенузи.
# Трикутник рівнобедрений. Що б взвести в степінь ставимо два рази множення


# два в степені три буде так 2**3, квадратний корінь з двух буде 2**(1/2)
# print("\nЗадача 9\n")
# var_1 = int(input("Введіть перший катет: "))
# result = ((var_1 ** 2) * 2)**(1/2)
# print(result)
#=======================================================================================================================


# 10 Школярі та яблука
# n школярів ділять k яблук порівну, недільний залишок залишається в кошику.
# Скільки яблук дістанеться кожному школярові та скільки залишиться в кошику?
# Програма отримує на вхід числа n і k - цілі, додатні, не перевищують 10000.


# print("\nЗадача 10\n")
# var_1 = int(input("Введіть кількість школярів: "))
# var_2 = int(input("Введіть кількість яблук: "))
# result = var_2 % var_1
# result_1 = var_2 // var_1
# print(f"Школярі отримали по {result_1} яблук в корзині залишилось {result} яблок")
#=======================================================================================================================



# 11 Магазин канцелярських товарів
# Одного разу, відвідавши магазин канцелярських товарів, Вася купив X олівців, Y ручок та Z фломастерів. Відомо,
# що ціна ручки на 2 гривні більше ціни олівця та на 7 гривень менше ціни фломастера. Також відомо,
# що вартість олівця становить 3 гривні. Потрібно визначити загальну вартість покупки.
# Вхідні дані
# просимо користувача ввести три змінні
# кожне з яких не перевищує 109.
# Вихідні дані
# виведіть одне ціле число – вартість покупки в гривнях.
# приклад для перевірки програми 1
# ввів: 1 1 1
# отримав: 20











# 12 Циферблад
# Запитайте в користувача скільки хвилин пройшло з початку доби.
# Визначте, скільки годин і хвилин покаже електронний годинник в цей момент і поверніть йому результат (формататування тексту при ввиводі не важливе).
# приклад для перевірки програми 1
# користувач ввів:150
# користувач отримує: 2, 30
# приклад для перевірки програми 2
# користувач ввів:1441
# користувач отримує: 0, 1












# 13 Журавлики
# Петро, Катя та Сергій роблять з паперу журавликів. Разом вони зробили S журавликів.
# Скільки журавликів зробила кожна дитина, якщо відомо, що Петро та Сергій зробили однакову кількість журавликів,
# а Катя зробила в два рази більше журавликів, ніж Петро та Сергій разом.
# Вхідні дані
# Юзер вводить загальну кількість журавликів. Отримує три значення скільки зробив кожен (Петро, Катя та Сергій).











# 14 Податки
# Прийшов час податків і вам треба написати програму що б допомогти відділу бугалтерії
# програма приймає від користувача його зарплату за 3 місяці та відсоток який він має сплатити.
# Виведіть на екран скільки треба сплатити податків за 3 місяці. Не забудьте ЄСВ(4422)


print("\nЗадача 14\n")
var_1 = int(input("Введіть загальну сумму ЗП за 3 місяці: "))
var_2 = int(input("Введіть відсоткову ставку: "))
result = var_1 * (var_2 /100)
result_1 = result + 4422
print(f"Вам треба сплатити: {result}грн відсоток, 4422грн (ЄСВ), разом до сплати {result_1}грн")
#=======================================================================================================================

# 1,2,3,4,5 - один бал
# 6,7,8,9,10,14 - два бала
# 11,12,13 - три бала






























