# Задача 1
#
# Напишіть програму яка запитує в користувача вартість покупок, він їх вводе через пробіл, точна кількість не вказана.
# Вам потрібно до вартості покупок додати 6,5 відсотки податків.
#
# Потім питаєте чи є в користувача купон на знижку якщо є то питаєте це на суму чи на відсоток і потім віднімаєте суму
# або відсоток відповідно від ціни яку отримали раніше і пишете користувачу кінцеву суму.
# * завдання з зірочкою не впливає на бал. Округліть суму якщо копійок більше ніж 44 то це буде + 1 гривня, якщо менше.
# то тоді просто відкидаємо копійки від ціни.


print("Для початку Введіть список цін купленних товарів")
list_of_prices = input("Введіть ціни через пробіл: ").split()

s = 0
for i in list_of_prices:
    s += float(i)
    k = float(s) / 100 * 6.5
    l = float(s) + k

print(round(l, 2))
print("Чи є у вас купон на знижку?")
discount = input("На суму чи на відсоток? sum / % : ")
sm = input("Напишіть сумму знижки: ")

if discount == "%":
    x = float(l) / 100 * int(sm)
    l -= x
    print("Сумма до сплати: ", round(l, 2))
else:
    l -= int(sm)
    print("Сумма до сплати: ", round(l, 2))


# Задача 2
# Переробіть задачу з попереднього уроку враховуючи ваші знання з цього уроку, використайте цикл for in або while.


# Задача 3
# Напишіть програму Банкомат. Втсановіть пін код для користувача(зробимо це константою).
# Запитайте в користувача Пін якщо він введе три рази не вірно то напишіть що карта заблокована. Використовуйте цикл while.


# Задача 4
# Напишіть за допомогою f-string та format. Дві стрічки де буде підставлятись імя та вік з зміних

name = input("Введіть своє ім'я: ")  # "оЛенА"
age = input("Введіть свій вік: ")  # 21

f_string = str(f"Я {name}, мені {age} рік ")  # тут ваш код формата ф-стрінг. | повино вийти -> Я Олена, мені 21 рік

# format_string = тут ваш код формата формат стрінг | повино вийти -> Я Олена, мені 21 рік

print(f_string)
#
# print(format_string)
