# Задача 1
#
# Напишіть програму яка запитує в користувача вартість покупок, він їх вводе через пробіл, точна кількість не вказана.
# Вам потрібно до вартості покупок додати 6,5 відсотки податків.
# Потім питаєте чи є в користувача купон на знижку якщо є то питаєте це на суму чи на відсоток і потім віднімаєте суму
# або відсоток відповідно від ціни яку отримали раніше і пишете користувачу кінцеву суму.
# * завдання з зірочкою не впливає на бал. Округліть суму якщо копійок більше ніж 44 то це буде + 1 гривня, якщо менше.
# то тоді просто відкидаємо копійки від ціни.


# list_of_prices = input("Для початку Введіть список цін купленних товарів \nВведіть ціни через пробіл: ").split()
#
# s = 0
# for i in list_of_prices:
#     s += float(i)
#     k = s + (s / 100 * 6.5)
#
# discount = input("Чи є у вас купон на знижку? \nНа суму чи на відсоток? sum / % : ")
# sm = input("Напишіть сумму знижки: ")
#
# if discount == "%":
#     x = float(k) / 100 * int(sm)
#     k -= x
#     print("Сумма до сплати: ", round(k, 2))
# else:
#     k -= int(sm)
#     print("Сумма до сплати: ", round(k, 2))
# print()
# =======================================================================================================================

# Задача 2
# Переробіть задачу з попереднього уроку враховуючи ваші знання з цього уроку,
# використайте цикл for in або while.


# print("Для початку Введіть список товарів мінімум 5 ")
# list_of_goods = input("Введіть ваші продукти через пробіл: ").split()
#
# print(f"Товари в списку {list_of_goods}")
#
# while len(list_of_goods) > 0:
#
#     if len(list_of_goods) == 0:
#         break
#     var = int(input("Введіть номер вже купленого товару: "))
#     list_of_goods.pop(var - 1)
#     print(list_of_goods)
#
# list_2 = input("Створити новий список? Y\\N ")
# if list_2.upper() == "Y":
#     list_of_goods = input("Введіть ваші продукти через пробіл: ").split()
#     print(list_of_goods)
# else:
#     print("Гарного дня!!!")


# =======================================================================================================================

# Задача 3
# Напишіть програму Банкомат. Втсановіть пін код для користувача(зробимо це константою).
# Запитайте в користувача Пін якщо він введе три рази не вірно
# то напишіть що карта заблокована.
# Використовуйте цикл while.


PIN =    1515
n = 0
while n < 3:
    pin = int(input("Введіть пінкод: "))
    if n == 2:
        print("Карта заблокована!!!")
        break
    elif pin != PIN:
        n += 1
        print(f"Не правильний пін спробуйте ще, у вас залишилось {3 - n} спроб.")
    else:
        print("Ласкаво просимо до вашого особистого кабінету")
        break

# =======================================================================================================================
# Задача 4
# Напишіть за допомогою f-string та format. Дві стрічки де буде підставлятись імя та вік з зміних


# name = input("Введіть своє ім'я: ")  # "оЛенА"
# age = input("Введіть свій вік: ")  # 21
#
# f_string = str(f"Я {name}, мені {age} рік ")  # тут ваш код формата ф-стрінг. | повино вийти -> Я Олена, мені 21 рік
#
# format_string = """Я {name}, мені {age} рік """.format(name=name, age=age)  # тут ваш код формата формат стрінг |
# # повино вийти -> Я Олена, мені 21 рік
# print()
# print(f_string)
# print(format_string)
