# Домашка
#
# Візьміть дві задачі з попередніх уроків,
# перша легка по вирішенню(декілька стрічок),
# друга більш складна і перепишіть їх на функції.
# Памятайте про Атамарність та god object.
# Там де написано що користувач має щось ввести то перероблюємо на функція приймає.
# Подивіться може можна за допомогою функції спростити код.
# В домашку вставте будь ласка опис задачі (далі(один з наступних уроків)
# буде домашка вашу домашку покрити тестами, але ми трохи поміняємо варіанти).



# Home work 4
# Задача 3
# Напишіть програму Банкомат. Втсановіть пін код для користувача(зробимо це константою).
# Запитайте в користувача Пін якщо він введе три рази не вірно
# то напишіть що карта заблокована.
# Використовуйте цикл while.

def pin_on():
    PIN = 1515
    n = 0
    while n < 3:
        pin = int(input("Введіть пінкод: "))
        if n == 2 and pin!=1515:
            print("Карта заблокована!!!")
            break
        elif pin != PIN :
            n += 1
            print(f"Не правильний пін спробуйте ще, у вас залишилось {3 - n} спроб.")
        else:
            print("Ласкаво просимо до вашого особистого кабінету")
            break

pin_on()